In [3]:
import pandas as pd
import sqlite3
connection = sqlite3.connect('data/jobs.db')

In [13]:
df = pd.read_sql("""
    SELECT
        country,
        COUNT(*)
    FROM
        jobs
    GROUP BY
        country
    ORDER BY
        count(*) DESC
    LIMIT
        10   """,con=connection)
df

  country  COUNT(*)
0      us       500
1      in       123
2      de        71
3      uk        61
4      ca        48
5      fr        46
6      nl        21
7      it        16
8      se        14
9      pl        14

In [14]:
df = pd.read_sql("""
    SELECT
        scrape_date,
        COUNT(*)
    FROM
        jobs
    GROUP BY
        scrape_date
    ORDER BY
        count(*) DESC   """,con=connection)
df

  scrape_date  COUNT(*)
0  2022-04-23       928
1  2022-04-24       136

In [28]:
df = pd.read_sql("""
    SELECT
        job_role_ext,
        SUM(CASE
            WHEN UPPER(description) LIKE '%SQL%' THEN 1
            ELSE 0
            END) / CAST(COUNT(*) AS float) *100 AS sql_percentage,
        SUM(CASE
            WHEN UPPER(description) LIKE '%PYTHON%' THEN 1
            ELSE 0
            END) / CAST(COUNT(*) AS float) *100 AS python_percentage,
        SUM(CASE
            WHEN UPPER(description) LIKE '%AIRFLOW%' THEN 1
            ELSE 0
            END) / CAST(COUNT(*) AS float) *100 AS airflow_percentage,
        SUM(CASE
            WHEN UPPER(description) LIKE '%AWS%' OR
            UPPER(description) LIKE '%GCP%' OR 
            UPPER(description) LIKE '%AZURE%' THEN 1
            ELSE 0
            END) / CAST(COUNT(*) AS float) *100 AS cloud_percentage
    FROM
        jobs
    GROUP BY
        job_role_ext
    ORDER BY
        2 DESC
    LIMIT
        10   """,con=connection)
df

,job_role_ext,sql_percentage,python_percentage,airflow_percentage,cloud_percentage
0,data engineer,76.440678,65.593220,17.457627,60.000000
1,data scientist,64.345992,84.599156,3.375527,28.902954

In [ ]:
wordcloud!!!